In [ ]:
# Name : Ashutosh Singh Kushwaha
# Admission No : 22MT0084
# ADBMS LAB 6

In [5]:
import time
import mysql.connector as cn
myconn = cn.connect(host = "localhost",user = "root",password = "Kushashu123",database = "adbms")
print(myconn)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000021EF7FBE770>

In [6]:
## Question 1
cursor = myconn.cursor(buffered = True)
start = time.time()
cursor.execute("select name from instructor where salary >any(select salary from instructor where dept_name = 'Biology') ") 
myresult = cursor.fetchall()
end =time.time()
print("time taken:",end - start)
for x in myresult:
    print(x)
print("time taken:",end - start)

time taken: 0.002530336380004883
(' Wu',)
('Einstein',)
('Gold',)
('Katz',)
('Singh',)
('Crick',)
('Brandt',)
('Kim',)
time taken: 0.002530336380004883

In [8]:
## Question 2
start = time.time()
cursor.execute("select name from instructor where salary >all(select salary from instructor where dept_name = 'Biology') ") 
end = time.time()
for x in cursor:
    print(x)
print("Tuple Count ",cursor.rowcount)
print("time taken:",end - start)

(' Wu',)
('Einstein',)
('Gold',)
('Katz',)
('Singh',)
('Brandt',)
('Kim',)
cursor rowcount: 7
time taken: 0.0015180110931396484

In [9]:
## Question 3
start = time.time()
cursor.execute("select dept_name ,avg(salary) as 'avg_salary'  from instructor group by dept_name having avg_salary>42000  ") 
end = time.time()
for x in cursor:
    print(x)
print("Tuple Count ",cursor.rowcount)
print("time taken:",end - start)

('Comp. Sci.', Decimal('77333.3333'))
('Biology', Decimal('69000.0000'))
('Finance', Decimal('85000.0000'))
('Physics', Decimal('91000.0000'))
('History', Decimal('61000.0000'))
('Elec. Eng.', Decimal('80000.0000'))
Tuple Count  6
time taken: 0.006013393402099609

In [10]:
## Question 4
start = time.time()
cursor.execute("with dept_total(dept_name,value) as (Select dept_name,sum(salary) from instructor GROUP BY dept_name) ,"

               "dept_totalAvg(value) as (Select Avg(value) from dept_total)"

               "Select dept_name,dept_total.value from dept_total,dept_totalAvg where dept_total.value>dept_totalAvg.value;")
end = time.time()
for x in cursor:
    print(x)
print("Tuple Count ",cursor.rowcount)
print("time taken:",end - start)

('Comp. Sci.', Decimal('232000'))
('Biology', Decimal('138000'))
('Finance', Decimal('170000'))
('Physics', Decimal('182000'))
Tuple Count  4
time taken: 0.0

In [12]:
## Question 5
start = time.time()
query = "select distinct(name) from instructor , teaches where instructor.id = teaches.id"
cursor.execute(query)
print(cursor.rowcount)
end =  time.time()
for x in cursor:
    print(x)
print("Tuple Count ",cursor.rowcount)
print("time taken : ",end-start)

9
('Srinivasan ',)
(' Wu',)
('Mozart',)
('Einstein',)
('El Said',)
('Katz',)
('Crick',)
('Brandt',)
('Kim',)
Tuple Count  9
time taken :  0.0

In [13]:
## Question 6
start = time.time()
query = "select distinct(a.name) as Name,b.course_id as course from  instructor a left join teaches b on a.id = b.id"
cursor.execute(query)
print(cursor.rowcount)
end =  time.time()
for x in cursor:
    print(x)
print("Tuple Count ",cursor.rowcount)
print("time taken : ",end-start)

18
('Srinivasan ', 'CS-347')
('Srinivasan ', 'CS-315')
('Srinivasan ', 'CS-101')
('Smith', None)
(' Wu', 'FIN-201')
('Mozart', 'MU-199')
('Einstein', 'PHY-101')
('El Said', 'HIS-351')
('Gold', None)
('Katz', 'CS-319')
('Katz', 'CS-101')
('Califieri', None)
('Singh', None)
('Crick', 'BIO-301')
('Crick', 'BIO-101')
('Brandt', 'CS-319')
('Brandt', 'CS-190')
('Kim', 'EE-181')
Tuple Count  18
time taken :  0.0026497840881347656

In [ ]:
## Question 7
query = "create view faculty as select id ,name ,dept_name from instructor"
cursor.execute(query)
print(cursor.rowcount)
for x in cursor:
    print(x)

In [14]:
start = time.time()
query = "select * from faculty"
cursor.execute(query)
print(cursor.rowcount)
end =  time.time()
for x in cursor:
    print(x)
print("time taken : ",end-start)

13
(10101, 'Srinivasan ', 'Comp. Sci.')
(10211, 'Smith', 'Biology')
(12121, ' Wu', 'Finance')
(15151, 'Mozart', 'Music')
(22222, 'Einstein', 'Physics')
(32343, 'El Said', 'History')
(33456, 'Gold', 'Physics')
(45565, 'Katz', 'Comp. Sci.')
(58583, 'Califieri', 'History')
(76543, 'Singh', 'Finance')
(76766, 'Crick', 'Biology')
(83821, 'Brandt', 'Comp. Sci.')
(98345, 'Kim', 'Elec. Eng.')
time taken :  0.0015377998352050781

In [ ]:
## Question 8
query = "create view dp as select dept_name , avg(salary) from instructor group by dept_name"
cursor.execute(query)

In [15]:
start = time.time()
query = "select * from dp"
cursor.execute(query)
print(cursor.rowcount)
end =  time.time()
for x in cursor:
    print(x)
print("time taken : ",end-start)

7
('Comp. Sci.', Decimal('77333.3333'))
('Biology', Decimal('69000.0000'))
('Finance', Decimal('85000.0000'))
('Music', Decimal('40000.0000'))
('Physics', Decimal('91000.0000'))
('History', Decimal('61000.0000'))
('Elec. Eng.', Decimal('80000.0000'))
time taken :  0.006888151168823242

In [ ]:
## Question 9
query = "create role 'student_role'"
cursor.execute(query)

In [ ]:
## Question 10
query = "grant select on adbms.faculty to 'student_role'"
cursor.execute(query)

In [37]:
import pandas as pd
cursor.execute("select * from instructor")
records=cursor.fetchall()
instructor_dataframe=pd.DataFrame(records)
instructor_dataframe.rename(columns={0:'ID',1:'name',2:'dept_name',3:'salary'},inplace = True)
print(instructor_dataframe)

       ID        name   dept_name   salary
0   10101  Srinivasan  Comp. Sci.  65000.0
1   10212         Tom     Biology      NaN
2   15151      Mozart       Music  40000.0
3   22222    Einstein     Physics  95000.0
4   32343     El Said     History  60000.0
5   33456        Gold     Physics  87000.0
6   45565        Katz  Comp. Sci.  75000.0
7   58583   Califieri     History  62000.0
8   76543       Singh     Finance  80000.0
9   76766       Crick     Biology  72000.0
10  83821      Brandt  Comp. Sci.  92000.0
11  98345         Kim  Elec. Eng.  80000.0

In [55]:
cursor.execute("select * from teaches")
records = cursor.fetchall()
teaches_dataframe = pd.DataFrame(records)
teaches_dataframe.rename(columns={0:'ID',1:'Course_id',2:'sec_id',3:'semester',4:'year'},inplace = True)
print(teaches_dataframe)

       ID Course_id  sec_id semester  year
0   10101    CS-101       1     Fall  2017
1   10101    CS-315       1   Spring  2018
2   10101    CS-347       1     Fall  2017
3   12121   FIN-201       1   Spring  2018
4   15151    MU-199       1   Spring  2018
5   32343   HIS-351       1   Spring  2018
6   45565    CS-101       1   Spring  2018
7   45565    CS-319       1   Spring  2018
8   76766   BIO-101       1   Summer  2017
9   76766   BIO-301       1   Summer  2018
10  83821    CS-190       1   Spring  2017
11  83821    CS-190       2   Spring  2017
12  83821    CS-319       2   Spring  2018
13  98345    EE-181       1   Spring  2017
14  22222   PHY-101       1     Fall  2017

In [39]:
from pandasql import sqldf
import pandas as pd

In [41]:
## Question 1
start = time.time()
alls = sqldf("select distinct T.name from instructor_dataframe as T, instructor_dataframe as S "
             " where T.salary > S.salary and S.dept_name = 'Biology'")
end = time.time()
print(alls)
print("time taken:",end - start)

       name
0  Einstein
1      Gold
2      Katz
3     Singh
4    Brandt
5       Kim
time taken: 0.037236928939819336

In [50]:
## Question 2 
start = time.time()
alls = sqldf("select distinct name from instructor_dataframe except "
             "select distinct T.name from instructor_dataframe as T, instructor_dataframe as S "
             " where T.salary >= S.salary and S.dept_name = 'Biology'")
end = time.time()
print(alls)
print("time taken:",end - start)

         name
0   Califieri
1     El Said
2      Mozart
3  Srinivasan
4         Tom
time taken: 0.027740001678466797

In [42]:
## Question 3
start = time.time()
alls = sqldf("select dept_name ,avg(salary) as 'avg_salary'  from instructor_dataframe "
             " group by dept_name having avg_salary>42000  ") 
end = time.time()
print(alls)
print("time taken:",end - start)

    dept_name    avg_salary
0     Biology  72000.000000
1  Comp. Sci.  77333.333333
2  Elec. Eng.  80000.000000
3     Finance  80000.000000
4     History  61000.000000
5     Physics  91000.000000
time taken: 0.038294315338134766

In [69]:
## Question 4
start = time.time()
alls =sqldf("with dept_total(dept_name,value) as (Select dept_name,sum(salary) from instructor_dataframe GROUP BY dept_name) ,"

               "dept_totalAvg(value) as (Select Avg(value) from dept_total)"

               "Select dept_name,dept_total.value from dept_total,dept_totalAvg where dept_total.value>dept_totalAvg.value;")

 
end = time.time()
print(alls)
print("time taken:",end - start)

    dept_name     value
0  Comp. Sci.  232000.0
1     History  122000.0
2     Physics  182000.0
time taken: 0.04084038734436035

In [57]:
## Question 5
start = time.time()
alls =sqldf(" select distinct( teaches_dataframe.Course_id ) , name from instructor_dataframe , teaches_dataframe "
            " where instructor_dataframe.ID = teaches_dataframe.ID")

end = time.time()
print(alls)
print("time taken:",end - start)

   Course_id        name
0     CS-101  Srinivasan
1     CS-315  Srinivasan
2     CS-347  Srinivasan
3     MU-199      Mozart
4    PHY-101    Einstein
5    HIS-351     El Said
6     CS-101        Katz
7     CS-319        Katz
8    BIO-101       Crick
9    BIO-301       Crick
10    CS-190      Brandt
11    CS-319      Brandt
12    EE-181         Kim
time taken: 0.1014547348022461

In [59]:
## Question 6
start = time.time()
alls =sqldf(" select distinct(Course_id ) , name from instructor_dataframe left join teaches_dataframe "
            " on instructor_dataframe.ID = teaches_dataframe.ID")

end = time.time()
print(alls)
print("time taken:",end - start)

   Course_id        name
0     CS-101  Srinivasan
1     CS-315  Srinivasan
2     CS-347  Srinivasan
3       None         Tom
4     MU-199      Mozart
5    PHY-101    Einstein
6    HIS-351     El Said
7       None        Gold
8     CS-101        Katz
9     CS-319        Katz
10      None   Califieri
11      None       Singh
12   BIO-101       Crick
13   BIO-301       Crick
14    CS-190      Brandt
15    CS-319      Brandt
16    EE-181         Kim
time taken: 0.036991119384765625

In [62]:
## Question 7 
start = time.time()
alls =sqldf(" create view facalty as select ID ,name,dept_name from instructor_dataframe")
end = time.time()
print(alls)
print("time taken:",end - start)

None
time taken: 0.03489828109741211

In [63]:
## Question 8
start = time.time()
alls =sqldf("create view dept_total_salary as select dept_name ,sum(salary) as 'Total' from instructor_dataframe"
            " group by dept_name ;")

end = time.time()
print(alls)
print("time taken:",end - start)

None
time taken: 0.03562784194946289

In [68]:
## Question 9
start = time.time()
alls =sqldf("create role student")
end = time.time()
print(alls)
print("time taken:",end - start)

None
time taken: 0.0323023796081543

In [67]:
## Question 10
start = time.time()
alls =sqldf("grant select on faculty to student")
end = time.time()
print(alls)
print("time taken:",end - start)

None
time taken: 0.022798538208007812